Core/src/InformationRegisters/РетроБонуси/РетроБонуси.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонуси</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>РетроБонус</name>
    <type>
      <types>CatalogRef.РетроБонусыИПроцентМаркетинговогоБюджета</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПроцентаРетроБонуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалогообложениеНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентМаркетинговогоБюджета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РозничнаяВесовая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АктивностьРетроБонуса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПереработчикуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИмпорта</name>
    <type>
      <types>CatalogRef.ПроцентыИмпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДляЧекаККМ</name>
    <type>
      <types>EnumRef.ВидыЧековДляНоменклатурыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Усушка_Потери</name>
    <type>
      <types>CatalogRef.Потери</types>
    </type>
  </attributes>
  <attributes>
    <name>Усушка_СписаниеНаПотери</name>
    <type>
      <types>CatalogRef.СписаниеНаПотери</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНомерЯчейки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpНоменклатурныеГруппы</name>
    <type>
      <types>CatalogRef.AzRytmpНоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpGUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/InformationRegisters/РетроБонуси/Forms/ФормаЗагрузкеИзТабличногоДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АдресЗарплатыВХранилище") Тогда 
		АдресЗарплатыВХранилище = Параметры.АдресЗарплатыВХранилище;
	КонецЕсли;
	
	Элементы.РезультатРаспознания.Видимость = ЛОЖЬ;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбразецФормата_xlsx(Команда)
	
	ОткрытьОбразец("xlsx");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьДанные(Команда)
	
	ОчиститьСообщения();
	ПроверитьЗаполнение();
	РаспознатьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ЗаписатьПодборВХранилище();
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогВыбораФайла.ПолноеИмяФайла = "";
    Фильтр = "Табличный документ (*.xls, *.xlsx, *.mxl)|*.xls;*.xlsx;*.mxl|";
    ДиалогВыбораФайла.Фильтр = Фильтр;
    ДиалогВыбораФайла.Заголовок = "Выберите файлы";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
  		
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
		//++Lazare 
		БинДанные = Новый ДвоичныеДанные(ДиалогВыбораФайла.ПолноеИмяФайла);		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(БинДанные, ЭтаФорма.УникальныйИдентификатор);
		ВыполнитьЗагрузкуНаСервере(АдресВременногоХранилища);
		//--Lazare
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере(Адрес)
	
	// Получение данных из временного хранилища
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	
	// Получение имени временного файла	
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("*.xls, *.xlsx, *.mxl)|*.xls;*.xlsx;*.mxl|");
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ПутьКФайлуНаСервере = ИмяВременногоФайла;
	// Сохранение данных во временный файл
	Данные.Записать(ИмяВременногоФайла);
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);

КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьДанныеФайлаОбразцаЗагрузки(ДанныеФайла, Расширение)
	
	Перем Менеджер;	
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ПолучитьМенеджерПоИмениОбъектаЗаполнения("Документ.НачислениеЗарплаты",Менеджер);
	
	Образец_xlsx = Менеджер.ПолучитьМакетЗагрузки();
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);	
	Адрес = ОбразецЗагрузкиДанных_xlsx;
	                   	
	НаименованиеФайлаБезРасширения = Нстр("ka='მონაცემების ჩატვირთვის ნიმუში';ru='ОбразецЗагрузкиДанных';en='ObrazetsZagruzkiDannyh'");
	
	ДанныеФайла.Вставить("ДатаМодификацииУниверсальная",ТекущаяДата());
	ДанныеФайла.Вставить("Зашифрован", 					Ложь);
	ДанныеФайла.Вставить("ИмяФайла",					НаименованиеФайлаБезРасширения + "." + Расширение);
	ДанныеФайла.Вставить("Наименование",				НаименованиеФайлаБезРасширения);
	ДанныеФайла.Вставить("ОтносительныйПуть",			"LD\"); //LoadData
	ДанныеФайла.Вставить("ПодписанЭП",					Ложь);
	ДанныеФайла.Вставить("Размер",						Неопределено);
	ДанныеФайла.Вставить("Расширение",					Расширение);
	ДанныеФайла.Вставить("Редактирует",					Неопределено);
	ДанныеФайла.Вставить("СсылкаНаДвоичныеДанныеФайла", Адрес);
	ДанныеФайла.Вставить("ФайлРедактируетТекущийПользователь", Ложь);
	ДанныеФайла.Вставить("ФайлРедактируется",			Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбразец(Расширение)
	
	ДанныеФайла = Новый Структура;
	ЗаполнитьДанныеФайлаОбразцаЗагрузки(ДанныеФайла, Расширение);
	
	ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса(ИмяКолонки)
	
	Если ИмяКолонки = "Контрагенты" Тогда 	
		
		Возврат
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Код КАК Код,
		|	Контрагенты.ИНН КАК ИНН
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ"		 
	Иначе		 
		Возврат
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.ОсновнойШтрихКод КАК ОсновнойШтрихКод,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура"
		
	КонецЕсли;

	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуПоиску(ИмяКолонки)

	ТаблицаВозврата = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса(ИмяКолонки);
	ТаблицаВозврата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВозврата;
	
КонецФункции // ПолучитьТаблицуПоиску(ЭлемСписка.Представление)()

&НаСервере
Функция ОпределитьСсылку(ТаблицаПоиска, ТекстЯчейки, НомерСтроки, МетодПоиска )

	
	Если МетодПоиска = 1 Тогда 		
		
		ПоискСтрокиКод = ТаблицаПоиска.НайтиСтроки(Новый Структура("Код", ТекстЯчейки));	
		
		Если ПоискСтрокиКод.Количество() = 1 Тогда 
			Возврат ПоискСтрокиКод[0].Ссылка;
		ИначеЕсли ПоискСтрокиКод.Количество() > 1 Тогда
			Сообщить("სტრიქონი №: "+НомерСтроки+", კოდის მიხედვით მოიძებნა ერთზე მეტი ელემენტი """+ТекстЯчейки+"""");
			Возврат НЕОПРЕДЕЛЕНО;
		КонецЕсли;
		
	ИначеЕсли  МетодПоиска = 2 Тогда		
		
		ПоискСтрокиИНН = ТаблицаПоиска.НайтиСтроки(Новый Структура("ИНН", ТекстЯчейки));
		
		Если ПоискСтрокиИНН.Количество() = 1 Тогда 
			Возврат ПоискСтрокиИНН[0].Ссылка;
		ИначеЕсли ПоискСтрокиИНН.Количество() > 1 Тогда
			Сообщить("სტრიქონი №: "+НомерСтроки+",საიდენტიფიკაციო კოდის მიხედვით მოიძებნა ერთზე მეტი ელემენტი """+ТекстЯчейки+"""");
			Возврат НЕОПРЕДЕЛЕНО;
		КонецЕсли;
		
	ИначеЕсли  МетодПоиска = 3 Тогда
		ПоискСтрокиАртикул = ТаблицаПоиска.НайтиСтроки(Новый Структура("Артикул", ТекстЯчейки));
		
		Возврат ПоискСтрокиАртикул[0].Ссылка;
		
	ИначеЕсли  МетодПоиска = 4 Тогда
		ПоискСтрокиШтрихкод = ТаблицаПоиска.НайтиСтроки(Новый Структура("ОсновнойШтрихКод", ТекстЯчейки));
		
		Возврат ПоискСтрокиШтрихкод[0].Ссылка;
		
	КонецЕсли;
	
	Сообщить("სტრიქონი №: "+НомерСтроки+", ძიებამ შედეგი არ გამოიღო. ძებნის მნიშვნელობა: """+ТекстЯчейки+"""");
	Возврат НЕОПРЕДЕЛЕНО;
	
КонецФункции 

&НаСервере
Процедура РаспознатьДанныеНаСервере()
	
	ТаблицаРезультат.Очистить();
	Элементы.Декорация1.Видимость = Истина;
	
	Элементы.ТабличныйДокумент.Видимость = ЛОЖЬ;
	
	тзОбрабоки = ТаблицаРезультат.Выгрузить();
	МассивНомеровКолонок = Новый Массив;
	
	СтруктураТаблицПоиска = Новый Структура;
	СтруктураТаблицПоиска.Вставить("Контрагенты", ПолучитьТаблицуПоиску("Контрагенты"));
	СтруктураТаблицПоиска.Вставить("Номенклатури", ПолучитьТаблицуПоиску("Номенклатура"));
 
	
	НомерСтроки = ?(НачальнаяСтрокаЧтения = 0, 2, НачальнаяСтрокаЧтения);
	КолСтрок = ТабличныйДокумент.ВысотаТаблицы;
	КолвоПустыхСтрокПодряд = 0;
	
	
	ВсяСтрокаПустая = Истина;
	СтруктураЗаполнения = Новый Структура;
	
	Для НомерСтроки = 2   По КолСтрок Цикл			
		
		ТаблицаПоискаКонтрагентов = СтруктураТаблицПоиска["Контрагенты"];
		ТаблицаПоискаНоменклатури = СтруктураТаблицПоиска["Номенклатури"];		
		
		//Период
		ТекстЯчейкиДатаОкончания = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C1").Текст);			
		Если НЕ СтруктураЗаполнения.Свойство("Период") Тогда 
			СтруктураЗаполнения.Вставить("Период", Дата(1,1,1));
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтруктураЗаполнения["Период"], ТекстЯчейкиДатаОкончания);

		
		//Контрагент
		ТекстЯчейкиКонтрагент = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C2").Текст;		
		СтруктураЗаполнения.Вставить("Контрагент", ОпределитьСсылку(ТаблицаПоискаКонтрагентов, ТекстЯчейкиКонтрагент, НомерСтроки, МетодПоискаКонтрагента));	
		
		//Номенклатура
		ТекстЯчейкиНоменклатура = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C3").Текст;		
		СтруктураЗаполнения.Вставить("Номенклатура", ОпределитьСсылку(ТаблицаПоискаНоменклатури, ТекстЯчейкиНоменклатура, НомерСтроки, МетодПоискаНоменклатур));	
		
		//Розничная/Весовая		
		ТекстЯчейкаРозничнаяВесовая = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C4").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("РозничнаяВесовая") Тогда 
			СтруктураЗаполнения.Вставить("РозничнаяВесовая", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["РозничнаяВесовая"], ТекстЯчейкаРозничнаяВесовая, 0);

		//ПроцентМаркетинговогоБюджета	
		ТекстЯчейкаПроцентМаркетинговогоБюджета = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C5").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("ПроцентМаркетинговогоБюджета") Тогда 
			СтруктураЗаполнения.Вставить("ПроцентМаркетинговогоБюджета", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["ПроцентМаркетинговогоБюджета"], ТекстЯчейкаПроцентМаркетинговогоБюджета, 0);
		
		//ПроцентРетробонуса	
		ТекстЯчейкаПроцентРетробонуса = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C6").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("ПроцентРетробонуса") Тогда 
			СтруктураЗаполнения.Вставить("ПроцентРетробонуса", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["ПроцентРетробонуса"], ТекстЯчейкаПроцентРетробонуса, 0);
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЗаполнения);
		
		
	КонецЦикла;
	
	
	Элементы.Декорация1.Видимость = ЛОЖЬ;
	
	Элементы.ТабличныйДокумент.Видимость = ИСтина;
	
	Элементы.РезультатРаспознания.Видимость = Истина;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатРаспознания;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТзДанныеЗагрузки = ТаблицаРезультат.Выгрузить();
	ПоместитьВоВременноеХранилище(ТзДанныеЗагрузки, АдресЗарплатыВХранилище);
	
	УдалитьФайлы(ПутьКФайлуНаСервере);
	
КонецПроцедуры

#КонецОбласти
